# Homebrew Bundle
# https://github.com/Homebrew/homebrew-bundle


# ------------------------------------------------------------------------------
# Starship Prompt
# ------------------------------------------------------------------------------

brew "starship"


# ------------------------------------------------------------------------------
# CLI Tools
# ------------------------------------------------------------------------------
brew "git"
brew "zsh"
brew "zsh-completions"
brew "node"
brew "coreutils"
brew "moreutils"
brew "findutils"
brew "gnu-sed"
brew "grep"
brew "nvm"
brew "tree"
brew "lsd"
brew "fzf"
brew "wget"
brew "tldr"
brew "mas"
brew "gh"
brew "terminal-notifier"
brew "wifi-password"
brew "speedtest-cli"
brew "bat"
brew "trash"
brew "youtube-dl"
brew "gallery-dl"
brew "prettyping"
brew "htop"
brew "jq"
brew "fd"
brew "diff-so-fancy"
brew "ncdu"
brew "neofetch"
brew "lazygit"
brew "aria2"

# ------------------------------------------------------------------------------
# Taps
# ------------------------------------------------------------------------------
#tap "homebrew/cask-fonts" - EXAMPLE

# ------------------------------------------------------------------------------
# Cask
# ------------------------------------------------------------------------------

# Fonts
cask "font-iosevka-term-nerd-font"

# Utils
cask "gpg-suite"
cask "pearcleaner" #app remover

# Media
#cask "transmission"
cask "vlc"
cask "obs"

# Development
cask "ghostty"
cask "visual-studio-code"

# Desktop applications
cask "telegram"
cask "google-chrome"
cask "firefox"
cask "slack"
cask "spotify"
cask "little-snitch"
cask "micro-snitch"

# Window and space management

tap "FelixKratz/formulae"
cask "borders"
cask "sketchybar"

# ------------------------------------------------------------------------------
# App Store applications
# ------------------------------------------------------------------------------
mas "Amphetamine", id: 937984704

